In [1]:
import pandas as pd

In [2]:
# Create initial DataFrame with missing values
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, None], 'City': ['New York', 'Los Angeles', None]}
df = pd.DataFrame(data)

# Puzzle 1: Identify missing values in a DataFrame.
missing_values = df.isnull()
print(missing_values)

    Name    Age   City
0  False  False  False
1  False  False  False
2  False   True   True

In [3]:
# Puzzle 2: Remove rows with missing values.
df_dropped = df.dropna()
print(df_dropped)

    Name   Age         City
0  Alice  25.0     New York
1    Bob  30.0  Los Angeles

In [4]:
# Puzzle 3: Fill missing values with a specified value.
df_filled = df.fillna(0)
print(df_filled)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   0.0            0

In [5]:
# Puzzle 4: Fill missing values using forward fill.
df_ffill = df.fillna(method='ffill')
print(df_ffill)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  30.0  Los Angeles

In [6]:

# Puzzle 5: Drop duplicate rows from a DataFrame.
df_no_duplicates = df.drop_duplicates()
print(df_no_duplicates)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   NaN         None

In [7]:
# Create initial DataFrame with a column to convert
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Category': ['A', 'B', 'A']}
df = pd.DataFrame(data)

In [8]:
# Puzzle 6: Convert a column to a categorical type.
df['Category'] = df['Category'].astype('category')
print(df)

      Name Category
0    Alice        A
1      Bob        B
2  Charlie        A

In [11]:
# Puzzle 7: Replace values in a column based on a condition.
df_ffill['Age'] = df_ffill['Age'].replace(25, 26)
print(df_ffill)

      Name   Age         City
0    Alice  26.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  30.0  Los Angeles